[
  {
    "id": "litti-chokha",
    "name": "Classic Litti Chokha",
    "description": "Our signature dish - roasted wheat balls with sattu filling",
    "longDescription": "The crown jewel of Bihari cuisine. Our Litti is made from whole wheat dough stuffed with roasted gram flour (sattu) mixed with aromatic spices, garlic, and herbs. Slow-roasted over traditional coal fire until perfectly charred and served with smoky baingan bharta, tomato chokha, and pure desi ghee.",
    "price": 180,
    "image": "/menu/litti-chokha.jpg",
    "tags": ["signature", "bestseller"],
    "spicyLevel": 2,
    "isVeg": true,
    "isBestseller": true
  },
  {
    "id": "sattu-paratha",
    "name": "Sattu Paratha",
    "description": "Crispy flatbread stuffed with spiced roasted gram flour",
    "longDescription": "A breakfast favorite from the streets of Patna. Flaky, layered paratha stuffed generously with roasted sattu mixed with green chilies, onions, and secret spices. Pan-fried in ghee to golden perfection. Served with pickle and curd.",
    "price": 120,
    "image": "/menu/sattu-paratha.jpg",
    "tags": ["breakfast"],
    "spicyLevel": 2,
    "isVeg": true,
    "isBestseller": false
  },
  {
    "id": "mutton-curry",
    "name": "Bihari Mutton Curry",
    "description": "Slow-cooked mutton in rich, aromatic gravy",
    "longDescription": "Tender pieces of mutton slow-cooked for hours in a rich gravy made with caramelized onions, ginger, garlic, and a secret blend of Bihari spices. The meat falls off the bone, infused with deep, complex flavors that define our culinary heritage.",
    "price": 380,
    "image": "/menu/mutton-curry.jpg",
    "tags": ["non-veg", "chef-special"],
    "spicyLevel": 3,
    "isVeg": false,
    "isBestseller": true
  },
  {
    "id": "kadhi-bari",
    "name": "Kadhi Bari",
    "description": "Gram flour dumplings in tangy yogurt curry",
    "longDescription": "A comforting bowl of Bihari Kadhi featuring soft pakodas (baris) made from gram flour, swimming in a silky, tangy yogurt-based gravy tempered with mustard seeds, curry leaves, and dried red chilies. Best enjoyed with steamed rice.",
    "price": 150,
    "image": "/menu/kadhi-bari.jpg",
    "tags": ["comfort-food"],
    "spicyLevel": 1,
    "isVeg": true,
    "isBestseller": false
  },
  {
    "id": "fish-curry",
    "name": "Maacher Jhol",
    "description": "Traditional Bengali-Bihari fish curry",
    "longDescription": "Fresh river fish cooked in a light, aromatic curry with tomatoes, turmeric, and green chilies. A testament to the riverine culture of Bihar. The fish is first marinated in turmeric and salt, lightly fried, then simmered in the curry until it absorbs all the flavors.",
    "price": 320,
    "image": "/menu/fish-curry.jpg",
    "tags": ["non-veg", "traditional"],
    "spicyLevel": 2,
    "isVeg": false,
    "isBestseller": false
  },
  {
    "id": "chana-ghugni",
    "name": "Chana Ghugni",
    "description": "Spiced chickpea curry, a popular street food",
    "longDescription": "A beloved street food from Bihar and Bengal. White chickpeas cooked with potatoes in a spicy, tangy gravy with cumin, coriander, and a touch of tamarind. Topped with fresh onions, green chilies, and a squeeze of lime. Perfect as a snack or side dish.",
    "price": 100,
    "image": "/menu/chana-ghugni.jpg",
    "tags": ["street-food", "snack"],
    "spicyLevel": 2,
    "isVeg": true,
    "isBestseller": false
  },
  {
    "id": "thekua",
    "name": "Thekua",
    "description": "Traditional sweet fried cookies",
    "longDescription": "A festive favorite, especially during Chhath Puja. These crispy, sweet cookies are made from whole wheat flour, jaggery, and ghee, flavored with fennel seeds and cardamom. Fried until golden and aromatic. A perfect ending to your Bihari meal.",
    "price": 80,
    "image": "/menu/thekua.jpg",
    "tags": ["dessert", "festive"],
    "spicyLevel": 0,
    "isVeg": true,
    "isBestseller": false
  },
  {
    "id": "chicken-boti",
    "name": "Chicken Boti Kebab",
    "description": "Tender marinated chicken pieces grilled to perfection",
    "longDescription": "Succulent pieces of chicken thigh marinated overnight in a blend of yogurt, ginger-garlic paste, and aromatic spices including mustard oil and roasted chana powder. Grilled in tandoor until charred on the outside and juicy inside. Served with mint chutney.",
    "price": 280,
    "image": "/menu/chicken-boti.jpg",
    "tags": ["non-veg", "tandoor"],
    "spicyLevel": 2,
    "isVeg": false,
    "isBestseller": true
  },
  {
    "id": "aloo-bhujia",
    "name": "Aloo Bhujia",
    "description": "Crispy spiced potato stir-fry",
    "longDescription": "Thinly sliced potatoes stir-fried with mustard oil, nigella seeds (kalonji), and green chilies until crispy on the edges. A simple yet addictive side dish that showcases the beauty of Bihari cooking - minimal ingredients, maximum flavor.",
    "price": 90,
    "image": "/menu/aloo-bhujia.jpg",
    "tags": ["side-dish"],
    "spicyLevel": 1,
    "isVeg": true,
    "isBestseller": false
  },
  {
    "id": "sattu-drink",
    "name": "Sattu Sharbat",
    "description": "Refreshing roasted gram flour drink",
    "longDescription": "The original protein shake! Roasted sattu mixed with cold water, lemon juice, roasted cumin, black salt, and a hint of jaggery. Incredibly refreshing and energizing - the perfect summer cooler that has fueled generations of Biharis.",
    "price": 60,
    "image": "/menu/sattu-drink.jpg",
    "tags": ["beverage", "healthy"],
    "spicyLevel": 0,
    "isVeg": true,
    "isBestseller": false
  },
  {
    "id": "dal-pitha",
    "name": "Dal Pitha",
    "description": "Steamed rice dumplings with lentil filling",
    "longDescription": "Delicate steamed dumplings made from rice flour, filled with a savory mixture of chana dal, ginger, and spices. Served with ghee and a side of tangy tomato chutney. A healthier alternative that doesn't compromise on taste.",
    "price": 140,
    "image": "/menu/dal-pitha.jpg",
    "tags": ["steamed", "healthy"],
    "spicyLevel": 1,
    "isVeg": true,
    "isBestseller": false
  },
  {
    "id": "kheer-makhana",
    "name": "Makhana Kheer",
    "description": "Creamy fox nut pudding",
    "longDescription": "Roasted makhana (fox nuts) simmered in reduced milk with cardamom, saffron, and rose water. Garnished with slivered almonds and pistachios. A luxurious dessert that celebrates Bihar's famous makhana harvest. Rich, creamy, and utterly indulgent.",
    "price": 120,
    "image": "/menu/makhana-kheer.jpg",
    "tags": ["dessert", "premium"],
    "spicyLevel": 0,
    "isVeg": true,
    "isBestseller": true
  }
]
